{
    "basic_info": {
      "description_header": "Welcome",
      "description": "Hello! My name is Andra Steele and I am a software developer based in Portland, Oregon. I am originally from Texas and have spent the last seven years traveling the world and working as a chef. I made my pivot into the tech sector at the height of the COVID-19 pandemic, and am excited to harness the skillset I have developed in the hospitality industry to become a better programmer. When I'm not coding, I enjoy cooking over live fire, drinking very good negronis, and exploring the Oregon Coast with my partner and pup.",
      "section_name": {
        "about": "About me",
        "projects": "Projects",
        "skills": "Skills",
        "experience": "Experience"
      }
    },
    "projects": [
      {
        "title": "Gallery of Horns",
        "startDate": "2022",
        "description": "Gallery of Horns is my first ever React application. It lists twenty horned creatures and utilizes forms, a modal, and various bootstrap stylings to showcase creatures in the gallery. The application was created utilizing React and Bootstrap.",
        "images": [
          "images/portfolio/hall-horns.jpg"
        ],
        "url": "https://steele-hall-o-horns.netlify.app/",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          }
        ]
      },
      {
        "title": "What Do You Wanna Eat?",
        "startDate": "2022",
        "description": "This is a collaborative group project for our Code Fellows 201 capstone project. WDYWE is an application written in vanilla Javascript that takes in user input to generate local restaurant recommendations based on personal food preferences and dietary restrictions. Ideally, if we were to expand on this project, we would implement an API to generate restaurants within a certain radius. This particular project is limited to the Seattle metro area.",
        "images": [
          "images/portfolio/wdywe.jpg"
        ],
        "url": "https://what-do-you-wanna-eat.github.io/WDYWE/",
        "technologies": [
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          }
        ]
      },
      {
        "title": "Q-amp (working title)",
        "startDate": "2022",
        "description": "This is an idea I have for my Code Fellows 301 capstone project. Based off of the queer-slang term, camp, Q-amp is an application designed for queer people to access and share information about the great outdoors. As an out queer person, all of my experiences relating to camping and backpacking have almost always included homophobic and transphobic driven altercations with other campers. I would like to create an application that utilizes a social media component to connect folks in the queer community by sharing their experiences in outdoor spaces. This application would utilize API's to list different campgrounds based on geographic region and desired terrain, while implementing a classifieds-like user listings to denote any dangerous (or fun!) notes for other folks wanting to get outside. The ultimate goal with this project is to keep queer people safe and promote more activity in outdoor spaces.",
        "images": [
          "images/portfolio/qamp.jpg"
        ],
        "url": "https://github.com",
        "technologies": [
          {
            "class": "devicon-react-original",
            "name": "React"
          },
          {
            "class": "devicon-bootstrap-plain",
            "name": "Bootstrap"
          },
          {
            "class": "devicon-javascript-plain",
            "name": "Javascript"
          }
        ]
      }
    ],
    "experience": [
      {
        "company": "Revel Meat Co.",
        "title": "Sales representative",
        "years": "07.2021 - present",
        "technologies": [], 
        "mainTech": []
      },
      {
        "company": "Jon & Vinny's Restaurant",
        "title": "Chef",
        "years": "10.2018 - 03.2020",
        "technologies": [], 
        "mainTech": []

      }
    ]
  }
